<!-- dflook/terraform-github-actions {"workspace":"unlock-state-2","backend_type":"remote","backend":"670edb4460e7866351c952c88a0a1d4a1e026298787db5360e4b3281fb054af6","plan_job_ref":"Job Test Terraform cloud #125 at https://github.com/dflook/terraform-github-actions/actions/runs/4028991199","plan_hash":"16d7e316c06f638994d61b7fc3d1785e55a538d919c0f466a1c2099378b6136a","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __unlock-state-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #125](https://github.com/dflook/terraform-github-actions/actions/runs/4028991199)